Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/the_irish_government/the_attorney_general.html.txt.tmx
Source language: en
Languages: ga

source: The Attorney General is the adviser to the Government on matters of law and legal opinion
ga: Cuireann an tArd Aighne comhairle ar an Rialtas i gcúrsaí dlí agus ábhair dá leithéid

source: Article 30 of the Constitution (Bunreacht na hEireann) created the office of the Attorney General
ga: Bhunaigh an Bunreacht oifig an Ard Aighne

source: Usually the person appointed is a lawyer who is politically associated with the party in power
ga: De ghnáth, is dlíodóir an té a cheaptar atá bainteach leis an bpáirtí atá i réim

source: While the Attorney General is not a member of the Government, they traditionally attend at Cabinet meetings
ga: Roghnaíonn an Taoiseach an tArd Aighne agus imíonn sé/sí as oifig nuair a athraíonn an Rialtas

source: The Attorney General has an important role, including:
ga: Tá ról tábhachtach ag an Ard-Aighne, a áiríonn:

source: • Advising the Government on all the constitutional and legal issues which arise in connection with or at Government meetings
ga: • Comhairle a thabhairt don Rialtas faoi shaincheisteanna bunreachta nó dlí a thagann i dtreis maidir le, nó le linn, cruinnithe den Rialtas

source: This includes advising whether proposed legislation complies with the provisions of the Irish Constitution, Acts and Treaties of the European Union or other international treaties to which Ireland has acceded
ga: Áiríonn sé seo comhairle faoi cé acu a dtagann nó nach dtagann an reachtaíocht atáthar a mholadh le forálacha Bhunreacht na hÉireann, Achtanna agus Chonarthaí an Aontais Eorpaigh nó conarthaí idirnáisiúnta eile atá glactha ag Éirinn

source: • Representing the public in all legal proceedings for the enforcement of law and the assertion or protection of public rights
ga: • Seasamh ar son an phobail i ngach imeacht dlí ar mhaithe leis an dlí a fheidhmiú agus na cearta poiblí a dhearbhú nó a chosaint

source: • Acting as lawyer for the State in virtually all civil litigation in which the State or its officers are official parties
ga: • Feidhmiú i gcáil dlíodóra don Stát i ngach dlíthíocht shibhialta, nach mór, ina bhfuil an Stát nó a chuid oifigeach ina bpáirtithe oifigiúla

source: • Giving legal advice on matters that are submitted by the Government, departments and offices and drafting necessary accompanying legal documents
ga: • Comhairle dlí a thabhairt ar ábhair a chuireann an Rialtas, na ranna agus na hoifigí rialtais faoina bhráid agus na doiciméid dlí riachtanacha a théann leo a dhréachtú

source: • Providing a solicitor service in all civil courts and tribunals in which the State, any State authority or the Attorney General is involved
ga: • Seirbhís aturnae a chur ar fáil i ngach cúirt shibhialta agus binse ina bhfuil an Stát nó údaráis ar bith de chuid an Stáit nó an tArd-Aighne i dtreis

source: The Attorney General's office oversees the Chief State Solicitor's Office and the Parliamentary Draftsman's Office
ga: Tá ceannasaíocht ag an Ard Aighne ar Phríomh Oifig Aturnae an Stáit agus ar Oifig Dhreachtóir na Parlaiminte
